# Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [2]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}

In [3]:
sozluk

{'var1': array([0, 4, 9, 0, 1]),
 'var2': array([0, 1, 2, 3, 6]),
 'var3': array([1, 2, 6, 2, 2])}

In [4]:
df = pd.DataFrame(sozluk)

In [5]:
df

   var1  var2  var3
0     0     0     1
1     4     1     2
2     9     2     6
3     0     3     2
4     1     6     2

In [6]:
df[0:1]

   var1  var2  var3
0     0     0     1

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.index = ["a","b","c","d","e"]

In [9]:
df

   var1  var2  var3
a     0     0     1
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [10]:
df["c":"e"]

   var1  var2  var3
c     9     2     6
d     0     3     2
e     1     6     2

In [11]:
#silme

In [12]:
df.drop("a", axis = 0)

   var1  var2  var3
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [13]:
df

   var1  var2  var3
a     0     0     1
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [14]:
df.drop("a", axis = 0, inplace = True)

In [15]:
df

   var1  var2  var3
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [16]:
#fancy

In [17]:
l = ["c","e"]

In [18]:
df.drop(l, axis = 0)

   var1  var2  var3
b     4     1     2
d     0     3     2

In [19]:
#degiskenler icin

In [20]:
df

   var1  var2  var3
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [21]:
"var1" in df

True

In [22]:
l = ["var1","var4","var2"]

In [23]:
for i in l:
    print(i in df)

True
False
True

In [24]:
df

   var1  var2  var3
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [25]:
df["var1"]

b    4
c    9
d    0
e    1
Name: var1, dtype: int32

In [26]:
df["var4"] = df["var1"] / df["var2"]

In [27]:
df

   var1  var2  var3      var4
b     4     1     2  4.000000
c     9     2     6  4.500000
d     0     3     2  0.000000
e     1     6     2  0.166667

In [28]:
#degisken silmek

In [29]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [30]:
df

   var1  var2  var3      var4
b     4     1     2  4.000000
c     9     2     6  4.500000
d     0     3     2  0.000000
e     1     6     2  0.166667

In [31]:
df.drop("var4", axis = 1, inplace = True)

In [32]:
df

   var1  var2  var3
b     4     1     2
c     9     2     6
d     0     3     2
e     1     6     2

In [33]:
l = ["var1","var2"]

In [34]:
df.drop(l, axis = 1)

   var3
b     2
c     6
d     2
e     2